example-doc/Models/Sequences/BasicSequence.puml
@startuml
'Generated by Modeler - do not change.
autonumber

actor "User" as user <<Actor>> 

participant "HR Frontend" as hr_frontend <<Application>> 

participant "HR Backend" as hr_backend <<Application>> 

database "HR Database" as hr_database <<Database>> 

participant "CRM" as crm <<ExternalSystem>> #FFD2BE

user -> hr_frontend : addEmployee (Employee)
activate hr_frontend

hr_frontend -> hr_backend : addEmployee (EmployeeDto)
activate hr_backend

hr_backend -> hr_backend : Validate (EmployeeDto)
hr_backend -> hr_database : addEmployee (SQL)
activate hr_database

hr_database --> hr_backend : OK ()
deactivate hr_database

hr_backend ->> crm : EmployeeAdded (EmployeeAddedEvent)
hr_backend --> hr_frontend : OK ()
deactivate hr_backend

hr_frontend --> user : OK ()
deactivate hr_frontend


@enduml
